{
  "categories": [
    {
      "id": 1,
      "title": "Indonesian Cuisine"
    },
    {
      "id": 2,
      "title": "Korean Cuisine"
    },
    {
      "id": 3,
      "title": "Japanese Cuisine"
    },
    {
      "id": 4,
      "title": "Italian Cuisine"
    },
    {
      "id": 5,
      "title": "American Cuisine"
    }
  ],
  "recipes": [
    {
      "id": 1,
      "listId": 1,
      "title": "Chicken Satay",
      "dishType": "Appetizer or Main entree",
      "prepTime_minutes": 25,
      "cookTime_minutes": 20,
      "servings": 6,
      "ingredients": ["soy sauce", "tomato sauce", "peanut oil", "minced garlic", "ground black pepper",
                "ground cumin", "cubed, skinless, and boneless chicken breast", "cooking oil",
                "minced onion", "water", "chunky peanut butter", "lemon juice", "skewers"],
      "instructions": ["In a bowl, mix soy sauce, tomato sauce, peanut oil, garlic, black pepper and cumin. Marinate chicken in sauce for 15 minutes.",
                "Preheat the grill at high heat",
                "Heat cooking oil in saucepan in medium heat, and saute onion and garlic. Mix in water, peanut butter, soy sauce, and sugar. Cook until blended evenly",
                "Lightly oil the grill grate. Thread chicken onto skewers, discard excess marinate, and grill skewers for 5 minutes at each side",
                "Serve chicken skewers with the peanut sauce"],
      "calories_per_serving": 329
    },
    {
      "id": 2,
      "listId": 2,
      "title": "Beef Japchae",
      "dishType": "Main entree",
      "prepTime_minutes": 10,
      "cookTime_minutes": 20,
      "servings": 3,
      "ingredients": ["soy sauce", "sugar", "oyster sauce", "sesame oil", "glass noodles", "baby spinach", "minced garlic",
              "sweet onions", "shiitake mushrooms", "black pepper", "shaved beef", "paprika", "cooking oil", "sesame seeds"],
      "instructions": ["Boil glass noodles for 7 minutes or according to the package",
              "Slice all vegetables: sweet onions, shiitake mushrooms, and paprika",
              "In a bowl, mix soy sauce, sugar, oyster sauce and sesame oil. Set aside",
              "Heat cooking oil in saucepan in medium heat, and saute sweet onions and minced garlic. When softened, add in the other sliced vegetables and shaved beef",
              "When beef is almost done cooking, add in the baby spinach. Place lid on pan and allow it to steam until wilted",
              "Pour in the mixed sauce and stir evenly",
              "Garnish with sesame seeds and ready to serve"],
      "calories_per_serving": 250
    },
    {
      "id": 3,
      "listId": 3,
      "title": "Beef Udon Noodle Soup",
      "dishType": "Main entree",
      "prepTime_minutes": 10,
      "cookTime_minutes": 15,
      "servings": 2,
      "ingredients": ["soy sauce", "dashi", "mirin", "sugar", "salt", "sliced green onion", "sliced sweet onion",
              "minced garlic","thinly sliced beef", "cooking oil", "water", "udon noodles", "2 eggs"],
      "instructions": ["Boil udon noodles for 11 minutes or according to the package. Rinse with cold water and set aside",
              "Boil two eggs for 7 minutes and set aside in cold water",
              "To make the broth, in a medium sauce pan, add water and 1 dashi packet. Bring to boil",
              "Allow to simmer for 3 minutes and discard the dashi packet. Then add soy sauce, mirin, sugar, and salt. Mix evenly and set aside",
              "Heat cooking oil on frying pan on medium heat. Cook sweet onions, green onions, and minced garlic for 3 minutes",
              "Add the meat and stir fry. Season with sugar and soy sauce. When done cooking, set aside",
              "Divide udon noodles into 2 separate serving bowls. Pour in the hot broth, place the stir fried beef and soft boiled egg on top",
              "Garnish with green onions and ready to serve"],
      "calories_per_serving": 579
    },
    {
      "id": 4,
      "listId": 4,
      "title": "Orecchiette Pasta",
      "dishType": "Main entree",
      "prepTime_minutes": 15,
      "cookTime_minutes": 30,
      "servings": 2,
      "ingredients": ["cooking oil", "diced sweet onion", "salt", "italian sausages", "chicken broth", "orecchiette pasta",
              "chopped arugula (or baby arugula)", "finely grated Parmigiano-Reggiano cheese"],
      "instructions": ["Heat cooking oil in a large, deep skillet over medium heat. Add onion and a pinch of salt. Cook for 5 minutes",
              "Remove casing from the italian sausages and add it in the skillet. Cook until browned (about 5 minutes)",
              "Pour chicken broth into the mixture. Bring to boil before adding the orecchiette pasta. Cook until pasta is cooked through (about 20 minutes)",
              "Add in arugula and stir until wilted",
              "Sprinkle Parmigiano-Reggiano cheese on top and ready to serve"],
      "calories_per_serving": 662
    },
    {
      "id": 5,
      "listId": 5,
      "title": "Burger",
      "dishType": "Main entree",
      "prepTime_minutes": 5,
      "cookTime_minutes": 10,
      "servings": 2,
      "ingredients": ["diced sweet onion", "salt", "ground black pepper", "beef patty", "pickle chips", "lettuce leaves",
              "sliced tomato", "butter", "American cheese", "burger buns", "mustard", "ketchup"],
      "instructions": ["Melt butter on a pan over medium heat. Add onion and cook until caramelized. Set aside",
              "On the same pan, cook beef patty. Season with black pepper and salt. Cook each side for 5 minutes",
              "Place cheese on top of the cooked beef patty and allow it to melt",
              "Place the patty with melted cheese on top of the burger bun. Stack with lettuce, caramelized onions, sliced tomatoes and pickles",
              "Season with mustard and ketchup",
              "Top with another bun and ready to serve (repeat for the other burger)"],
      "calories_per_serving": 354
    },
    {
      "id": 6,
      "listId": 3,
      "title": "Oyakodon",
      "dishType": "Main entree",
      "prepTime_minutes": 5,
      "cookTime_minutes": 10,
      "servings": 2,
      "ingredients": ["soy sauce", "dashi", "mirin", "sugar", "eggs", "cubed chicken thighs", "green onion", "sliced sweet onion"],
      "instructions": ["In a bowl, mix soy sauce, dashi, mirin and sugar. Bring to a simmer for 1 minute",
        "Add chicken cubes in a single layer. Cook until tender and no longer pink for about 5 minutes on each side",
        "Add beaten egg on top",
        "Garnish with green onion and ready to serve"],
      "calories_per_serving": 600
    }
  ]
}